Repository: muhammadnur777/targetbeta
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Русский
uz: Rus tili

source: English
uz: Inglis tili

source: Главная
uz: Bosh sahifa

source: О школе
uz: Maktab haqida

source: Отзывы
uz: Fikrlar

source: Контакты
uz: Kontaktlar

source: Target International School – школа будущих лидеров в бизнесе и IT
uz: Target International School – biznes va IT sohasida kelajak liderlari maktabi

source: Международное образование с акцентом на английский язык, предпринимательство и современные технологии.
uz: Xalqaro taʼlim, ingliz tili, tadbirkorlik va zamonaviy texnologiyalarga yoʻnaltirilgan.

source: Получить консультацию
uz: Maslahat oling

source: лет работы
uz: ish yillari

source: учеников
uz: oʻquvchilar

source: поступают в вузы за рубежом
uz: chet el universitetlariga qabul qilinadi

source: филиала
uz: filiallari

source: Почему выбирают
uz: Nima uchun bizni tanlaydilar

source: Международная программа обучения
uz: Xalqaro o‘quv dasturi

source: Интеграция лучших мировых образовательных стандартов.
uz: Jahonning eng yaxshi taʼlim standartlarini integratsiya qilish.

source: Углублённое изучение английского языка
uz: Ingliz tilini chuqur o‘rganish

source: Подготовка к IELTS и SAT и другим международным экзаменам.
uz: IELTS, SAT va boshqa xalqaro imtihonlarga tayyorgarlik.

source: Поддержка при поступлении в университеты
uz: Universitetga qabul bo‘yicha qo‘llab‑quvvatlash

source: Консультации и помощь в выборе вуза и подготовки документов.
uz: Universitet tanlash va hujjatlarni tayyorlash bo‘yicha maslahat va yordam.

source: Индивидуальный подход
uz: Individual yondashuv

source: Малые классы и персонализированные планы обучения.
uz: Kam sinflar va shaxsiy o‘quv rejalari.

source: Современная инфраструктура
uz: Zamonaviy infratuzilma

source: Оснащённые классы, лаборатории и зоны для отдыха.
uz: Jihozlangan sinflar, laboratoriyalar va dam olish zonalari.

source: Уроки по бизнесу и IT
uz: Biznes va IT darslari

source: Развитие предпринимательских навыков и цифровой грамотности.
uz: Tadbirkorlik ko‘nikmalari va raqamli savodxonlikni rivojlantirish.

source: Образование, которое открывает двери<br> в международное будущее
uz: Taʼlim, xalqaro kelajakka eshiklar ochadigan<br> darslar

source: С 2015 года Target International School предоставляет качественное образование, сочетая академические знания с практическими навыками в области бизнеса и информационных технологий. Наши выпускники успешно поступают в ведущие университеты и строят карьеру в международных компаниях.
uz: 2015 yildan beri Target International School yuqori sifatli taʼlim taqdim etadi, akademik bilimlarni biznes va axborot texnologiyalari sohasidagi amaliy ko‘nikmalar bilan birlashtiradi. Bitiruvchilarimiz yetakchi universitetlarga qabul qilinib, xalqaro kompaniyalarda faoliyat yuritmoqdalar.

source: Программы обучения<br> для всех возрастов
uz: O‘quv dasturlari<br> har qanday yosh uchun

source: Начальная школа
uz: Boshlang‘ich maktab

source: (1-4 классы)
uz: (1–4 sinflar)

source: Формирование базовых навыков и интереса к обучению.
uz: Asosiy ko‘nikmalarni shakllantirish va taʼlimga qiziqishni oshirish.

source: Средняя школа
uz: O‘rta maktab

source: (5-8 классы)
uz: (5–8 sinflar)

source: Углубленное изучение предметов и развитие критического мышления.
uz: Fanlarni chuqur o‘rganish va tanqidiy fikrlashni rivojlantirish.

source: Старшая школа
uz: Oliy maktab

source: (9-11 классы)
uz: (9–11 sinflar)

source: Подготовка к выпускным экзаменам и поступлению в вузы.
uz: Yakuniy imtihonlar va universitetga kirishga tayyorgarlik.

source: Что говорят наши ученики и родители
uz: O‘quvchilarimiz va ota‑onalarimiz nimalar deydi

source: Оставить отзыв
uz: Fikr bildirish

source: Оценка:
uz: Baholash:

source: Отправить
uz: Yuborish

source: Международный экзамен по математике, чтению и письму,<br> используемый при поступлении в университеты США.
uz: Matematika, o‘qish va yozuv bo‘yicha xalqaro imtihon,<br> AQSH universitetlariga qabul qilinishda qo‘llanadi.

source: Подготовка к SAT формирует критическое мышление, аналитические<br> навыки и уверенное владение английским языком в академическом контексте.
uz: SAT tayyorgarligi tanqidiy fikrlash, analitik<br> ko‘nikmalar va akademik kontekstda ingliz tilini ishonchli egallashni shakllantiradi.

source: Международная система оценки владения английским для учёбы, работы и миграции
uz: O‘qish, ish va migratsiya uchun ingliz tilini baholashning xalqaro tizimi

source: Признаётся более чем 11 500 организациями в 140 странах
uz: 140 ta davlatda 11 500 dan ortiq tashkilot tomonidan tan olingan

source: Оценивает четыре навыка: Listening, Reading, Writing и Speaking —<br> актуально для поступления в англоязычные университеты.
uz: To‘rt ko‘nikma — Listening, Reading, Writing va Speaking —<br> ingliz tilidagi universitetlarga qabul uchun muhim.

source: Результаты целевой подготовки
uz: Maqsadli tayyorgarlik natijalari

source: Средний SAT Score наших студентов превышает 1400.
uz: O‘quvchilarimizning o‘rtacha SAT balli 1400 dan yuqori.

source: IELTS—баллы от 7.0 и выше, что соответствует уровню C1 (продвинутый пользователь).
uz: IELTS—7.0 va undan yuqori ballar, bu C1 (oldinda foydalanuvchi) darajasiga to‘g‘ri keladi.

source: Более 50 000 студентов по всей стране успешно сдают IELTS в 2024г. — рост в 5 раз по сравнению с 2020 г.
uz: 2024 yilda butun mamlakat bo‘yicha 50 000 dan ortiq talaba muvaffaqiyatli IELTS topshirdi — 2020 yilga nisbatan 5 barobar o‘sish.

source: Ответы на популярные вопросы
uz: Tez‑tez so‘raladigan savollarga javoblar

source: Какие языки преподаются?
uz: Qaysi tillar o‘tiladi?

source: Английский, узбекский, русский, китайский
uz: Ingliz, o‘zbek, rus, xitoy

source: Есть ли подготовка к международным экзаменам?
uz: Xalqaro imtihonlarga tayyorgarlik bormi?

source: Да, школа Target готовит к SAT и IELTS с высокими результатами.
uz: Ha, Target maktabi SAT va IELTS ga yuqori natijalar bilan tayyorlaydi.

source: Как записаться на экскурсию?
uz: Ekskursiyaga qanday ro‘yxatdan o‘tish mumkin?

source: кликните здесь, чтобы оставить заявку на экскурсию
uz: Ekskursiya uchun ariza qoldirish uchun shu yerga bosing

source: Остались вопросы?
uz: Savollaringiz qolgan bo‘lsa?

source: Оставьте свой номер телефона и мы ответим на все интересующие вас вопросы
uz: Telefon raqamingizni qoldiring, biz sizni qiziqtirgan barcha savollarga javob beramiz

source: Ваше Ф.И.О
uz: Ismingiz, familiyangiz va sharifingiz

source: Записаться на консультацию
uz: Maslahat uchun yoziling

source: Отправлено! Мы скоро свяжемся с вами.
uz: Yuborildi! Tez orada bog‘lanamiz.

source: школа будущих лидеров в бизнесе и IT
uz: biznes va IT kelajak liderlari maktabi

source: Разделы
uz: Bo‘limlar

source: Адреса
uz: Manzillar
